# ğŸš€ GUIA DE EXECUÃ‡ÃƒO - 3 TERMINAIS

## âš ï¸ IMPORTANTE: Abre 3 terminais WSL separados

---

## ğŸ“º TERMINAL 1 - CONTROLADOR

### Passo 1: Navegar para a pasta

```bash
cd '/mnt/c/Users/H0LF/Documents/SO2025/so_2425_tp_JoaoPais_2020131717_RuiMarques_2021123220'
```

### Passo 2: Configurar nÃºmero de veÃ­culos

```bash
export NVEICULOS=3
```

### Passo 3: Iniciar o controlador

```bash
./controlador
```

**SaÃ­da esperada:**

```
=== CONTROLADOR DE FROTA DE VEÃCULOS AUTÃ“NOMOS ===
NÃºmero mÃ¡ximo de veÃ­culos: 3
Sistema iniciado.

> _
```

### Comandos disponÃ­veis:

```
> listar          # Ver todos os serviÃ§os agendados
> utiliz          # Ver utilizadores conectados
> frota           # Ver estado dos veÃ­culos ativos
> cancelar <id>   # Cancelar serviÃ§o (0 = todos)
> km              # Total de km percorridos
> hora            # Tempo simulado atual
> terminar        # Encerrar todo o sistema
```

---

## ğŸ“º TERMINAL 2 - CLIENTE 1 (JoÃ£o)

### Passo 1: Navegar para a pasta (novo terminal)

```bash
cd '/mnt/c/Users/H0LF/Documents/SO2025/so_2425_tp_JoaoPais_2020131717_RuiMarques_2021123220'
```

### Passo 2: Iniciar cliente

```bash
./cliente joao
```

**SaÃ­da esperada:**

```
=== CLIENTE DE TRANSPORTE ===
A conectar como joao...
Bem-vindo joao!
Digite 'ajuda' para ver os comandos disponÃ­veis.

joao> _
```

### Exemplo de uso:

```bash
joao> agendar 10 Coimbra 50
# SaÃ­da: ServiÃ§o agendado com ID 1 para hora 10

joao> agendar 20 Porto 30
# SaÃ­da: ServiÃ§o agendado com ID 2 para hora 20

joao> consultar
# SaÃ­da: Lista dos serviÃ§os agendados por joao

# Esperar que o tempo chegue a 10 segundos...
# O veÃ­culo vai contactar quando chegar

# Quando receber mensagem do veÃ­culo:
joao> entrar Lisboa

# Durante a viagem, pode sair a meio:
joao> sair

# Ou deixar completar atÃ© ao destino

joao> terminar
```

---

## ğŸ“º TERMINAL 3 - CLIENTE 2 (Maria)

### Passo 1: Navegar para a pasta (novo terminal)

```bash
cd '/mnt/c/Users/H0LF/Documents/SO2025/so_2425_tp_JoaoPais_2020131717_RuiMarques_2021123220'
```

### Passo 2: Iniciar cliente

```bash
./cliente maria
```

**SaÃ­da esperada:**

```
=== CLIENTE DE TRANSPORTE ===
A conectar como maria...
Bem-vindo maria!
Digite 'ajuda' para ver os comandos disponÃ­veis.

maria> _
```

### Exemplo de uso:

```bash
maria> agendar 15 Lisboa 40
# SaÃ­da: ServiÃ§o agendado com ID 3 para hora 15

maria> consultar
# SaÃ­da: Lista dos serviÃ§os agendados por maria

maria> cancelar 3
# SaÃ­da: ServiÃ§o 3 cancelado

maria> terminar
```

---

## ğŸ¬ FLUXO COMPLETO DE TESTE

### Fase 1: InicializaÃ§Ã£o (0s)

1. **Terminal 1**: Iniciar controlador
2. **Terminal 2**: Conectar cliente joao
3. **Terminal 3**: Conectar cliente maria

### Fase 2: Agendamentos (0-5s)

4. **Terminal 2** (joao): `agendar 10 Coimbra 50`
5. **Terminal 3** (maria): `agendar 15 Porto 30`
6. **Terminal 1**: `listar` â†’ Ver os 2 serviÃ§os

### Fase 3: ExecuÃ§Ã£o do ServiÃ§o (10s)

7. **Aguardar** atÃ© tempo = 10s (controlador lanÃ§a veÃ­culo automaticamente)
8. **Terminal 2** receberÃ¡: `[VEÃCULO] VeÃ­culo chegou ao local: Coimbra`
9. **Terminal 2** (joao): `entrar Lisboa`
10. **VeÃ­culo** reporta: `ENTROU`, `PERCENTAGEM:10`, `PERCENTAGEM:20`, ...
11. **Terminal 1**: `frota` â†’ Ver veÃ­culo ativo

### Fase 4: MonitorizaÃ§Ã£o (durante viagem)

12. **Terminal 1**: `utiliz` â†’ Ver joÃ£o em viagem
13. **Terminal 1**: `frota` â†’ Ver percentagem
14. **Terminal 1**: `km` â†’ Ver km percorridos (vai aumentando)

### Fase 5: ConclusÃ£o

15. VeÃ­culo reporta `PERCENTAGEM:100` e `CHEGOU`
16. **Terminal 2** recebe: `[VEÃCULO] Chegou ao destino: Lisboa`
17. **Terminal 1**: `km` â†’ Ver total atualizado
18. **Terminal 2** (joao): `terminar`
19. **Terminal 3** (maria): `terminar`
20. **Terminal 1**: `terminar` â†’ Encerra todo o sistema

---

## ğŸ§ª TESTES ESPECÃFICOS

### Teste 1: Limite de Utilizadores (30)

Abrir 30 terminais e conectar 30 clientes diferentes. O 31Âº deve ser rejeitado.

### Teste 2: Limite de VeÃ­culos (NVEICULOS)

```bash
export NVEICULOS=2
./controlador
```

Agendar 3 serviÃ§os para a mesma hora. Apenas 2 veÃ­culos lanÃ§ados, o 3Âº fica em espera.

### Teste 3: Cancelamento com SIGUSR1

```bash
# Terminal 1 (durante viagem):
cancelar 1

# Terminal 2 receberÃ¡: [VEÃCULO] Viagem cancelada
```

### Teste 4: Cliente sai a meio

```bash
# Terminal 2 (durante viagem):
sair

# VeÃ­culo reporta: SAIU: Cliente saiu a meio da viagem (40%)
```

### Teste 5: Select() no Cliente

```bash
# Terminal 2:
# Enquanto escreves um comando, deves receber mensagens do veÃ­culo
# sem interromper o que estÃ¡s a escrever
```

---

## ğŸ› TROUBLESHOOTING

### Problema: "Controlador nÃ£o estÃ¡ em execuÃ§Ã£o"

**SoluÃ§Ã£o**: Iniciar primeiro o Terminal 1 (controlador)

### Problema: "Username jÃ¡ em uso"

**SoluÃ§Ã£o**: Usar username diferente ou terminar o cliente anterior

### Problema: "Limite de utilizadores atingido"

**SoluÃ§Ã£o**: Terminar alguns clientes ou reiniciar controlador

### Problema: FIFOs nÃ£o sÃ£o removidos

**SoluÃ§Ã£o**:

```bash
rm -f /tmp/fifo_controlador /tmp/fifo_cliente_* /tmp/fifo_veiculo_*
```

### Problema: Processos "zombie"

**SoluÃ§Ã£o**:

```bash
pkill controlador
pkill cliente
pkill veiculo
```

---

## ğŸ“ OBSERVAÃ‡Ã•ES IMPORTANTES

1. **Ordem de execuÃ§Ã£o**: SEMPRE iniciar o controlador primeiro
2. **Tempo simulado**: Cada segundo real = 1 segundo simulado
3. **VeÃ­culos automÃ¡ticos**: SÃ£o lanÃ§ados pelo controlador, nÃ£o executar manualmente
4. **Named pipes**: Criados/removidos automaticamente
5. **Telemetria**: VisÃ­vel no terminal do controlador (stdout do veÃ­culo)
6. **Select()**: Cliente consegue receber mensagens enquanto digita comandos

---

## âœ… VERIFICAÃ‡ÃƒO DE FUNCIONAMENTO

Se tudo estiver correto, deves ver:

**Terminal 1 (Controlador):**

```
[LOGIN] Cliente joao conectado (PID 1234)
[AGENDAR] joao agendou serviÃ§o 1
[INFO] VeÃ­culo lanÃ§ado (PID 5678) para serviÃ§o 1
VEICULO_LANCADO: ID=1, Cliente=joao, Local=Coimbra, Distancia=50km
ENTROU: Cliente entrou no veÃ­culo. Destino: Lisboa
PERCENTAGEM:10
PERCENTAGEM:20
...
CHEGOU: Cliente chegou ao destino: Lisboa
```

**Terminal 2 (Cliente joao):**

```
Bem-vindo joao!
joao> agendar 10 Coimbra 50
ServiÃ§o agendado com ID 1 para hora 10
joao> [VEÃCULO] VeÃ­culo chegou ao local: Coimbra. Use 'entrar <destino>' para iniciar.
joao> entrar Lisboa
Entrando no veÃ­culo. Destino: Lisboa
joao> [VEÃCULO] Chegou ao destino: Lisboa. DistÃ¢ncia: 50 km
```

**Terminal 3 (Cliente maria):**

```
Bem-vindo maria!
maria> consultar
Nenhum serviÃ§o agendado.
```

---

## ğŸ¯ COMANDOS RÃPIDOS

### Setup inicial (copiar/colar):

```bash
# Terminal 1
cd '/mnt/c/Users/H0LF/Documents/SO2025/so_2425_tp_JoaoPais_2020131717_RuiMarques_2021123220'
export NVEICULOS=3
./controlador

# Terminal 2 (novo terminal)
cd '/mnt/c/Users/H0LF/Documents/SO2025/so_2425_tp_JoaoPais_2020131717_RuiMarques_2021123220'
./cliente joao

# Terminal 3 (novo terminal)
cd '/mnt/c/Users/H0LF/Documents/SO2025/so_2425_tp_JoaoPais_2020131717_RuiMarques_2021123220'
./cliente maria
```

### Teste rÃ¡pido (copiar/colar em cada terminal):

```bash
# Terminal 2 (joao)
agendar 5 Coimbra 20
consultar

# Terminal 3 (maria)
agendar 10 Porto 30
consultar

# Terminal 1 (controlador)
listar
utiliz

# Aguardar 5 segundos...

# Terminal 2 (quando veÃ­culo chegar)
entrar Lisboa

# Terminal 1 (durante viagem)
frota
km
```

---

**ğŸ“š DocumentaÃ§Ã£o completa em README.md**
**âœ… VerificaÃ§Ã£o de requisitos em VERIFICACAO_100_PERCENT.md**
